[
        {
            "question": "Does the text follow a linear narrative structure?",
            "statement": "The text follows a linear narrative structure."
        },
        {
            "question": "Does the text follow a non-linear narrative structure?",
            "statement": "The text follows a non-linear narrative structure."
        },
        {
            "question": "Does the text follow a circular narrative structure, the story ends where it began?",
            "statement": "The text follows a circular narrative structure, ending where it began."
        },
        {
            "question": "Does the text have a multiple storyline narrative structure?",
            "statement": "The text has a multiple storyline narrative structure."
        },
        {
            "question": "Does the text have subplot threads interwoven into the main narrative?",
            "statement": "The text contains subplot threads interwoven into the main narrative."
        },
        {
            "question": "Is the text organized into a standard three act structure (beginning, middle, end)?",
            "statement": "The text follows a standard three-act structure (beginning, middle, end)."
        },
        {
            "question": "Is the theme of good vs evil explored in this text?",
            "statement": "The theme of good vs evil is explored in this text."
        },
        {
            "question": "Is the theme of love explored in this text?",
            "statement": "The theme of love is explored in this text."
        },
        {
            "question": "Is the theme of family explored in this text?",
            "statement": "The theme of family is explored in this text."
        },
        {
            "question": "Is the theme of loneliness explored in this text?",
            "statement": "The theme of loneliness is explored in this text."
        },
        {
            "question": "Is the theme of revenge explored in this text?",
            "statement": "The theme of revenge is explored in this text."
        },
        {
            "question": "Is the theme of identity and self exploration explored in this text?",
            "statement": "The theme of identity and self-exploration is explored in this text."
        },
        {
            "question": "Is the theme of social and political issues explored in this text?",
            "statement": "The theme of social and political issues is explored in this text."
        },
        {
            "question": "Is the theme of power and corruption explored in this text?",
            "statement": "The theme of power and corruption is explored in this text."
        },
        {
            "question": "Is the theme of loss and grief explored in this text?",
            "statement": "The theme of loss and grief is explored in this text."
        },
        {
            "question": "Is the theme of nature and environment explored in this text?",
            "statement": "The theme of nature and the environment is explored in this text."
        },
        {
            "question": "Are there repeating thematic patterns or symbols in the text?",
            "statement": "The text contains repeating thematic patterns or symbols."
        },
        {
            "question": "Is there one clear main character in the text?",
            "statement": "There is one clear main character in the text."
        },
        {
            "question": "Are there multiple side characters that are important to the plot?",
            "statement": "There are multiple side characters important to the plot."
        },
        {
            "question": "Is there a clear antagonist character in the text?",
            "statement": "There is a clear antagonist character in the text."
        },
        {
            "question": "Is the protagonist's main goal/desire one that is moral?",
            "statement": "The protagonist's main goal/desire is moral."
        },
        {
            "question": "Does the main character undergo character growth?",
            "statement": "The main character undergoes character growth."
        },
        {
            "question": "Is the author's primary message of this text to entertain?",
            "statement": "The author's primary message in this text is to entertain."
        },
        {
            "question": "Is the author's primary message of this text to inform?",
            "statement": "The author's primary message in this text is to inform."
        },
        {
            "question": "Is the author's primary message of this text to persuade?",
            "statement": "The author's primary message in this text is to persuade."
        },
        {
            "question": "Is the author's primary message of this text to critique?",
            "statement": "The author's primary message in this text is to critique."
        },
        {
            "question": "Is the author primarily aiming to evoke positive emotions with this text?",
            "statement": "The author primarily aims to evoke positive emotions with this text."
        },
        {
            "question": "Is the author primarily aiming to evoke negative emotions with this text?",
            "statement": "The author primarily aims to evoke negative emotions with this text."
        },
        {
            "question": "Is the author primarily aiming to evoke thought-provoking emotions with this text?",
            "statement": "The author primarily aims to evoke thought-provoking emotions with this text."
        },
        {
            "question": "Is the author primarily aiming to evoke contradictory emotions with this text?",
            "statement": "The author primarily aims to evoke contradictory emotions with this text."
        },
        {
            "question": "Does the story in the text involve many different settings?",
            "statement": "The story in the text involves many different settings."
        },
        {
            "question": "How integral does the setting seem to the story based on the text?",
            "statement": "The setting is integral to the story."
        },
        {
            "question": "Does the story take place in modern society?",
            "statement": "The story takes place in modern society."
        },
        {
            "question": "Does the story take place in a fantasy world?",
            "statement": "The story takes place in a fantasy world."
        },
        {
            "question": "Does the story take place in a historical setting?",
            "statement": "The story takes place in a historical setting."
        },
        {
            "question": "Is the plot of this text predictable?",
            "statement": "The plot of this text is predictable."
        },
        {
            "question": "Does the text contain a major twist?",
            "statement": "The text contains a major twist."
        },
        {
            "question": "Does the text contain a central conflict?",
            "statement": "The text contains a central conflict."
        },
        {
            "question": "Is the plot of this text engaging?",
            "statement": "The plot of this text is engaging."
        },
        {
            "question": "Does the plot of the text come to a satisfying resolution?",
            "statement": "The plot of the text comes to a satisfying resolution."
        },
        {
            "question": "Does the plot end in a cliffhanger?",
            "statement": "The plot ends in a cliffhanger."
        },
        {
            "question": "Does the text engage diverse demographic or cultural groups?",
            "statement": "The text engages diverse demographic or cultural groups."
        },
        {
            "question": "After reading this text are you in a positive mood?",
            "statement": "After reading this text, I am in a positive mood."
        },
        {
            "question": "After reading this text are you in a negative mood?",
            "statement": "After reading this text, I am in a negative mood."
        }
    ]